TrampolineRTOS/trampoline/machines/cortex-m/armv7em/efm32wg/emlib/src/em_can.c
  for (size_t i = 0; i < length; i++) {
    data[i] = message->data[i];
  }

  CAN_ReadyWait(can, interface);
  mir->DATAL = (data[3] << 24)
               | (data[2] << 16)
               | (data[1] << 8)
               | (data[0] << 0);
  mir->DATAH = (data[7] << 24)
               | (data[6] << 16)
               | (data[5] << 8)
               | (data[4] << 0);
}

/***************************************************************************//**
 * @brief
 *   Send request for writing or reading the RAM of Message Object msgNum.
 *
 * @param[in] can
 *   Pointer to CAN peripheral register block.
 *
 * @param[in] interface
 *   Indicate which Message Interface Register to use.
 *
 * @param[in] msgNum
 *   Message number of the Message Object, [1 - 32].
 *
 * @param[in] wait
 *   If true, wait for the end of the transfer between the MIRx registers and
 *   the RAM to exit. If false, exit immediately, the transfer can still be
 *   in progress.
 ******************************************************************************/
void CAN_SendRequest(CAN_TypeDef *can,
                     uint8_t interface,
                     uint8_t msgNum,
                     bool wait)
{
  CAN_MIR_TypeDef * mir = &can->MIR[interface];

  /* Make sure msgNum is in the correct range */
  EFM_ASSERT((msgNum > 0) && (msgNum <= 32));

  /* Make sure the MIRx registers aren't busy */
  CAN_ReadyWait(can, interface);

  /* Write msgNum to the CMDREQ register */
  mir->CMDREQ = msgNum << _CAN_MIR_CMDREQ_MSGNUM_SHIFT;

  if (wait) {
    CAN_ReadyWait(can, interface);
  }
}

/** @} (end addtogroup CAN) */
/** @} (end addtogroup emlib) */

#endif /* defined(CAN_COUNT) && (CAN_COUNT > 0) */
